# 元组就是一个“不可变的列表”
# 1、作用：按照索引/位置存放多个值，只用于读不用于改

# 2、定义：（）内用逗号分隔开多个任意类型的元素
# t=(1,1.2,'aaa')
# print(t,type(t))

# x= (10) # 单独一个括号代表包含的意思
# print(x,type(x))

# t=(10,) # 若果元组中只有一个元素，必须加逗号
# print(t,type(t))

# t=(1,1.2,'aaa')  # t=(0->值1的内存地址,1->值1.2的内存地址,2->值'aaa'的内存地址)
# print(t[2])


# t = (1,[11,22])
# print(id(t[0]),id(t[1]))
#
# t[1][0]=11111111
# print(t)
# print(id(t[0]),id(t[1]))

# 3、类型转换
# print(tuple('hello'))
# print(tuple([1, 2, 3, 4]))
# print(tuple({'a1': 111, 'a2': 222}))

# 4、内置方法

# 优先掌握的操作：
# 1、按索引取值(正向取+反向取)：只能取
# 2、切片(顾头不顾尾，步长)
# 3、长度
# 4、成员运算in和not in

# 5、循环
